function fish_greeting
echo "     ▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄" | lolcat
echo "     █▄▄░▄▄█░▄▄█░█░█▄░▄████░▄▄▄█░▄▄▀█░▄▄▀█▀▄▀█░██░█" | lolcat
echo "     ███░███░▄▄█▀▄▀██░█████░▄▄██░▀▀░█░██░█░█▀█░▀▀░█" | lolcat
echo "     ███░███▄▄▄█▄█▄██▄█████░████▄██▄█▄██▄██▄██▀▀▀▄█" | lolcat
echo "     ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀" | lolcat
toilet  -f smblock -F gay --filter border:gay "======== T I O L E T ========"
echo -e "{⌐■_■} > -- ︻╦╤─ ~ ~ ~ ~ ..........📌¯\_(ツ)_/¯🔪.......\e[5m" | cowsay -f eyes | lolcat
printf '\e[0;35m ▀▀▀▄▀▄▀▄▀▄▀'
printf '\e[1m\e[4m\e[50;34m GPU='
printf '%s' (cat /sys/class/thermal/thermal_zone1/temp) °C
printf '\e[0;35m ▀▄▀▄▀▄▀'
printf '\e[1m\e[4m\e[42;93m🌡️ TEMPS 🌡️'
printf ' \e[0;35m\e ▀▄▀▄▀▄▀'
printf '\e[1m\e[4m\e[50;34m CPU='
printf '%s' (cat /sys/class/thermal/thermal_zone0/temp) °C
printf '\e[0;35m ▀▄▀▄▀▄▀▄▀▄▀▀▀'
end
